docs/mac_os.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>mac-os</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="orga9a4d27">
<div class="navbar-brand" id="orgfc6794a">
<div class="navbar-item" id="org5844732">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="orgc7ca5ec">
<div class="navbar-start" id="org1b65356">
<div class="navbar-item" id="org7d73327">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="orgebc5dcc">

</div>

</div>
</nav>
<div id="outline-container-orgbe68986" class="outline-2">
<h2 id="orgbe68986">Mac/ios</h2>
<div class="outline-text-2" id="text-orgbe68986">
</div>
<div id="outline-container-orgc6639b2" class="outline-3">
<h3 id="orgc6639b2">notes</h3>
<div class="outline-text-3" id="text-orgc6639b2">
<ul class="org-ul">
<li>BSD based</li>
<li>dmg apps mounted</li>
<li>ios browser is skin on webkit only</li>
<li>Apple pozzed
<ul class="org-ul">
<li>serial coded software that bricks with 'improper' hardware</li>
<li>CSAM scanning of all files
<ul class="org-ul">
<li>false flags and foss generator for broken algorithm</li>
</ul></li>
<li>known unpatched exploits actively used
<ul class="org-ul">
<li>pegasus (israeli nso) - imessage remote exploit</li>
<li>patched after some years
<ul class="org-ul">
<li>DROPOUTJEEP (snowden leaks)</li>
<li>SONICSCREWDRIVER (vault 7 leaks) - firmware password bypass</li>
<li>Admin framework backdoor (2011 - 10.10.3+)</li>
<li>etc</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>